#+TITLE: deb文件的格式
#+AUTHOR: lujun9972
#+TAGS: linux和它的小伙伴
#+DATE: [2017-03-10 五 15:54]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil
#+ID:79576000

一个 =deb= 包其实就是一个ar格式的打包文件. 可以用 =ar= 命令解开 =deb= 包. 
#+BEGIN_SRC shell
  debdir=/tmp/sl
  mkdir -p $debdir
  debfile=$debdir/sl.deb
  if ! [[ -f $debfile ]];then
      wget http://mirrors.kernel.org/ubuntu/pool/restricted/s/sl-modem/sl-modem-daemon_2.9.11~20110321-12_i386.deb -O $debfile
  fi
  ar -x $debfile
  ls $debdir
#+END_SRC

#+RESULTS:
| control.tar.gz |
| data.tar.xz    |
| debian-binary  |
| sl.deb         |

解开后,会发现 =deb= 包中包含了三个文件:

+ debian-binary – 这是个文本文件,指明deb包格式的版本号.
+ control.tar.gz – 这个压缩文件中包含了md5验证码,并且包含了安装package时的一些配置信息.
+ data.tar.xz – 这个压缩文件中包含的是所有会安装到系统中的文件.
